#pragma once

#include <array>
#include <map>

const std::array<const std::wstring, 256> DecodeTable =
{
	L" ", L"À", L"Á", L"Â", L"Ç", L"È", L"É", L"Ê", L"Ê", L"Ì", L" ", L"Î", L"Ï", L"Ò", L"Ó", L"Ô",
	/*L"Œ"*/L" ", L"Ù", L"Ú", L"Û", L"Ñ", L"ß", L"à", L"á", L" ", L"ç", L"è", L"é", L"ê", L"ë", L"ì", L" ",
	L"î", L"ï", L"ò", L"ó", L"ô", /*L"œ"*/ L" ", L"ù", L"ú", L"û", L"ñ", L"º", L"ª", /*L"ᵉʳ"*/ L" ",L"&", L"+", L" ",
	L" ", L" ", L" ", L" ", L"Lv",L"=", L";", L" ", L" ", L" ", L" ", L" ", L" ", L" ", L" ", L" ",
	L" ", L" ", L" ", L" ", L" ", L" ", L" ", L" ", L" ", L" ", L" ", L" ", L" ", L" ", L" ", L" ",
	/*L"▯"*/ L" ", L"¿", L"¡", L"PK",L"MN",L"PO",L"Ké",L"~1",L"~2",L"~3",L"Í", L"%", L"(", L")", L" ", L" ",
	L" ", L" ", L" ", L" ", L" ", L" ", L" ", L" ", L"â", L" ", L" ", L" ", L" ", L" ", L" ", L"í",
	L" ", L" ", L" ", L" ", L" ", L" ", L" ", L" ", L" ", /*L"⬆", L"⬇", L"⬅",L"➡"*/L" ",L" ",L" ",L" ",L"*", L"*", L"*",
	L"*", L"*", L"*", L"*", /*L"ᵉ"*/L" ", L"<", L">", L" ", L" ", L" ", L" ", L" ", L" ", L" ", L" ", L" ",
	L" ", L" ", L" ", L" ", L" ", L" ", L" ", L" ", L" ", L" ", L" ", L" ", L" ", L" ", L" ", L" ",
	/*L"ʳᵉ"*/ L" ",L"0", L"1", L"2", L"3", L"4", L"5", L"6", L"7", L"8", L"9", L"!", L"?", L".", L"-", /*L"・"*/L" ",
	L"...",/*L"“",L"”"*/L"\"",L"\"", /*L"‘", L"’"*/L"'",L"'", /*L"♂", L"♀"*/L"[M]",L"[F]", L"~", L",", L"×",L"/", L"A", L"B", L"C", L"D", L"E",
	L"F", L"G", L"H", L"I", L"J", L"K", L"L", L"M", L"N", L"O", L"P", L"Q", L"R", L"S", L"T", L"U",
	L"V", L"W", L"X", L"Y", L"Z", L"a", L"b", L"c", L"d", L"e", L"f", L"g", L"h", L"i", L"j", L"k",
	L"l", L"m", L"n", L"o", L"p", L"q", L"r", L"s", L"t", L"u", L"v", L"w", L"x", L"y", L"z", /*L"▶"*/ L" ",
	L":", L"Ä",L"Ö", L"Ü", L"ä", L"ö", L"ü", L" ", L" ", L" ", L" ", L" ", L" ", L" ", L" ", L" ",
};

const std::map<std::wstring, uint8_t> EncodeTable =
{
	{ L" ", 0x00 }, { L"À", 0x01 }, { L"Á", 0x02 }, { L"Â", 0x03 }, { L"Ç", 0x04 }, { L"È", 0x05 }, { L"É", 0x06 }, { L"Ê", 0x07 },
	{ L"Ê", 0x08 }, { L"Ì", 0x09 }, { L"Î", 0x0b }, { L"Ï", 0x0c }, { L"Ò", 0x0d }, { L"Ó", 0x0e }, { L"Ô", 0x0f }, { L"Ù", 0x11 },
	{ L"Ú", 0x12 }, { L"Û", 0x13 }, { L"Ñ", 0x14 }, { L"ß", 0x15 }, { L"à", 0x16 }, { L"á", 0x17 }, { L"ç", 0x19 }, { L"è", 0x1a },
	{ L"é", 0x1b }, { L"ê", 0x1c }, { L"ë", 0x1d }, { L"ì", 0x1e }, { L"î", 0x20 }, { L"ï", 0x21 }, { L"ò", 0x22 }, { L"ó", 0x23 },
	{ L"ô", 0x24 }, { L"ù", 0x26 }, { L"ú", 0x27 }, { L"û", 0x28 }, { L"ñ", 0x29 }, { L"º", 0x2a }, { L"ª", 0x2b }, { L"&", 0x2d },
	{ L"+", 0x2e }, { L"Lv", 0x34 }, { L"=", 0x35 }, { L";", 0x36 },{ L"¿", 0x51 }, { L"¡", 0x52 }, { L"PK", 0x53 }, { L"MN", 0x54 },
	{ L"PO", 0x55 }, { L"Ké", 0x56 }, { L"~", 0x57 },{ L"~", 0x58 }, { L"~", 0x59 }, { L"Í", 0x5a }, { L"%", 0x5b }, { L"(", 0x5c },
	{ L")", 0x5d }, { L"â", 0x68 }, { L"í", 0x6f }, { L"*", 0x7d }, { L"*", 0x7e }, { L"*", 0x7f }, { L"*", 0x80 }, { L"*", 0x81 }, 
	{ L"*", 0x82 }, { L"*", 0x83 }, { L"<", 0x85 }, { L">", 0x86 }, { L"0", 0xa1 }, { L"1", 0xa2 }, { L"2", 0xa3 }, { L"3", 0xa4 },
	{ L"4", 0xa5 }, { L"5", 0xa6 }, { L"6", 0xa7 }, { L"7", 0xa8 }, { L"8", 0xa9 }, { L"9", 0xaa }, { L"!", 0xab }, { L"?", 0xac },
	{ L".", 0xad }, { L"-", 0xae }, { L"...", 0xb0 }, { L"\"", 0xb1 }, { L"\"", 0xb2 }, { L"'", 0xb3 }, { L"'", 0xb4 }, { L"[M]", 0xb5 },
	{ L"[F]", 0xb6 }, { L"~", 0xb7 }, { L",", 0xb8 }, { L"×", 0xb9 }, { L"/", 0xba }, { L"A", 0xbb }, { L"B", 0xbc }, { L"C", 0xbd },
	{ L"D", 0xbe }, { L"E", 0xbf }, { L"F", 0xc0 }, { L"G", 0xc1 }, { L"H", 0xc2 }, { L"I", 0xc3 }, { L"J", 0xc4 }, { L"K", 0xc5 },
	{ L"L", 0xc6 }, { L"M", 0xc7 }, { L"N", 0xc8 }, { L"O", 0xc9 }, { L"P", 0xca }, { L"Q", 0xcb }, { L"R", 0xcc }, { L"S", 0xcd },
	{ L"T", 0xce }, { L"U", 0xcf }, { L"V", 0xd0 }, { L"W", 0xd1 }, { L"X", 0xd2 }, { L"Y", 0xd3 }, { L"Z", 0xd4 }, { L"a", 0xd5 },
	{ L"b", 0xd6 }, { L"c", 0xd7 }, { L"d", 0xd8 }, { L"e", 0xd9 }, { L"f", 0xda }, { L"g", 0xdb }, { L"h", 0xdc }, { L"i", 0xdd },
	{ L"j", 0xde }, { L"k", 0xdf }, { L"l", 0xe0 }, { L"m", 0xe1 }, { L"n", 0xe2 }, { L"o", 0xe3 }, { L"p", 0xe4 }, { L"q", 0xe5 },
	{ L"r", 0xe6 }, { L"s", 0xe7 }, { L"t", 0xe8 }, { L"u", 0xe9 }, { L"v", 0xea }, { L"w", 0xeb }, { L"x", 0xec }, { L"y", 0xed },
	{ L"z", 0xee }, { L":", 0xf0 }, { L"Ä", 0xf1 }, { L"Ö", 0xf2 }, { L"Ü", 0xf3 }, { L"ä", 0xf4 }, { L"ö", 0xf5 }, { L"ü", 0xf6 },
};